{
  "MainNav": [
    { "path": "home", "linkName": "Home" },
    { "path": "how to play", "linkName": "How To Play" },
    { "path": "more", "linkName": "More" },
    { "path": "facebook", "linkName": "<a href='https://www.facebook.com/' target='_blank'><i class='fab fa-facebook-square'></i></a>" },
    { "path": "instagram", "linkName": "<a href='https://www.instagram.com/' target='_blank'><i class='fab fa-instagram'></i></a>" },
    { "path": "twitter", "linkName": "<a href='https://twitter.com/?lang=en' target='_blank'><i class='fab fa-twitter-square'></i></a>" }
  ],

  "Pages": [
    { "pageName": "home", "content": "<div class='hero'><div class='callout'><h1>Volleyball Explained</h1><h4>Your one stop for learning Volleyball</h4></div><div class='hero-player'></div></div><!-- about --><!-- about --><!-- about --><!-- about --><!-- about --><!-- about --><!-- about --><div class='about'><h1>About</h1><div class='section-container'><div class='text'><p>Volleyball, game played by two teams, usually of six players on a side, in which the players use their hands to bat a ball back and forth over a high net, trying to make the ball touch the court within the opponents’ playing area before it can be returned. To prevent this a player on the opposing team bats the ball up and toward a teammate before it touches the court surface—that teammate may then volley it back across the net or bat it to a third teammate who volleys it across the net. A team is allowed only three touches of the ball before it must be returned over the net.</p></div><div class='about-img'></div></div></div><!-- history --><!-- history --><!-- history --><!-- history --><!-- history --><!-- history --><!-- history --><div class='history'><h1>History</h1><div class='section-container'><div class='text'><p>Volleyball was invented in 1895 by William G. Morgan, physical director of the Young Men’s Christian Association (YMCA) in Holyoke, Massachusetts. It was designed as an indoor sport for businessmen who found the new game of basketball too vigorous. Morgan called the sport “mintonette,” until a professor from Springfield College in Massachusetts noted the volleying nature of play and proposed the name of “volleyball.” The original rules were written by Morgan and printed in the first edition of the Official Handbook of the Athletic League of the Young Men’s Christian Associations of North America (1897). The game soon proved to have wide appeal for both sexes in schools, playgrounds, the armed forces, and other organizations in the United States, and it was subsequently introduced to other countries.</p><p>In 1916 rules were issued jointly by the YMCA and the National Collegiate Athletic Association (NCAA). The first nationwide tournament in the United States was conducted by the National YMCA Physical Education Committee in New York City in 1922. The United States Volleyball Association (USVBA) was formed in 1928 and recognized as the rules-making, governing body in the United States. From 1928 the USVBA—now known as USA Volleyball (USAV)—has conducted annual national men’s and senior men’s (age 35 and older) volleyball championships, except during 1944 and 1945. Its women’s division was started in 1949, and a senior women’s division (age 30 and older) was added in 1977. Other national events in the United States are conducted by member groups of the USAV such as the YMCA and the NCAA.</p></div><div class='william-img'></div></div></div><!-- beach --><!-- beach --><!-- beach --><!-- beach --><!-- beach --><!-- beach --><!-- beach --><div class='beach'><h1>Beach</h1><div class='section-container'><div class='text'><p>Beach volleyball—usually played, as its name implies, on a sand court with two players per team—was introduced in California in 1930. The first official beach volleyball tournament was held in 1948 at Will Rogers State Beach, in Santa Monica, California, and the first FIVB-sanctioned world championship was held in 1986 at Rio de Janeiro. Beach volleyball was added to the roster of the 1996 Olympic Games in Atlanta, Georgia.</p></div><div class='beach-img'></div></div></div>" },
    { "pageName": "how to play", "content": "<!-- Rules --><!-- Rules --><!-- Rules --><!-- Rules --><!-- Rules --><!-- Rules --><!-- Rules --><div class='rules'><h1>Basic Volleyball Rules</h1><div class='section-container'><div class='text'><ul><li>6 players on the floor at any one time - 3 in the front row and 3 in the back row</li><li>Maximum of 3 hits per side</li><li>Points are made on every serve for wining team of rally (rally-point scoring).</li><li>Player may not hit the ball twice in succession. (A block is not considered a hit.)</li><li>Ball may be played off the net during a volley and on a serve.</li><li>A ball hitting a boundary line is in.</li><li>A ball is out if it hits an antennae, the floor completely outside the court, any of the net or cables outside the antennae, the referee stand or pole, the ceiling above a non-playable area.</li><li>It is legal to contact the ball with any part of a player’s body.</li><li>It is illegal to catch, hold or throw the ball.</li><li>A player cannot block or attack a serve from on or inside the 10-foot line.</li><li>After the serve, front-line players may switch positions at the net.</li><li>Matches are made up of sets; the number depends on level of play. 3-set matches are 2 sets to 25 points and a third set to 15. Each set must be won by two points. The winner is the first team to win 2 sets. 5-set matches are 4 sets to 25 points and fifth set to 15. The team must win by 2 unless tournament rules dictate otherwise. The winner is the first team to win three sets.</li></ul></div><div class='rules-img'></div></div></div><!-- violations --><!-- violations --><!-- violations --><!-- violations --><!-- violations --><!-- violations --><!-- violations --><div class='violations'><h1>Basic Volleyball Rule Violations</h1><div class='section-container'><div class='text'><ul><li>When serving, the player steps on or across the service line as while making contact with the ball.</li><li>Failure to serve the ball over the net successfully.</li><li>Ball-handling errors. Contacting the ball illegally (double touching, lifting, carrying, throwing, etc.)</li><li>Touching the net with any part of the body while the ball is in play.</li><li>When blocking a ball coming from the opponent’s court, it’s illegal to contact the ball when reaching over the net if both your opponent has not used 3 contacts AND they have a player there to make a play on the ball.</li><li>When attacking a ball coming from the opponent’s court, contacting the ball when reaching over the net is a violation if the ball has not yet broken the vertical plane of the net.</li><li>Crossing the court centerline with any part of your body is a violation. Exception: if it is the hand or foot. In this case, the entire hand or entire foot must cross for it to be a violation.</li><li>Serving out of rotation/order.</li><li>Back-row player blocking (deflecting a ball coming from the opponent) when, at the moment of contact, the back-row player is near the net and has part of his/her body above the top of the net. This is an illegal block.</li><li>Back-row player attacking a ball inside the front zone (the area inside the 3M/10-foot line) when, at the moment of contact, the ball is completely above the net. This is an illegal attack.</li></ul></div><div class='violations-img'></div></div></div><!-- skills --><!-- skills --><!-- skills --><!-- skills --><!-- skills --><!-- skills --><!-- skills --><div class='skills'><h1>Basic Volleyball Skills</h1><h4>Serve</h4><div class='section-container'><div class='text'><p>A player stands behind the inline and serves the ball, in an attempt to drive it into the opponent's court. The main objective is to make it land inside the court; it is also desirable to set the ball's direction, speed and acceleration so that it becomes difficult for the receiver to handle it properly.A serve is called an 'ace' when the ball lands directly onto the court or travels outside the court after being touched by an opponent; when the only player on the server's team to touch the ball is the server.With serving there are two main types, the underhand serve and the overhand serve.</p></div><div class='serve-img'></div></div><h4>Pass</h4><div class='section-container'><div class='text'><p>Also called reception, the pass is the attempt by a team to properly handle the opponent's serve or any form of attack. Proper handling includes not only preventing the ball from touching the court but also making it reach the position where the setter is standing quickly and precisely.</p><p>The skill of passing involves fundamentally two specific techniques: underarm pass, or bump, where the ball touches the inside part of the joined forearms or platform, at waistline; and overhand pass, where it is handled with the fingertips, like a set, above the head.Either are acceptable in professional and beach volleyball; however, there are much tighter regulations on the overhand pass in beach volleyball.</p></div><div class='pass-img'></div></div><h4>Set</h4><div class='section-container'><div class='text'><p>The set is usually the second contact that a team makes with the ball.The main goal of setting is to put the ball in the air in such a way that it can be driven by an attack into the opponent's court.The setter coordinates the offensive movements of a team, and is the player who ultimately decides which player will actually attack the ball.</p><p>As with passing, one may distinguish between an overhand and a bump set. Since the former allows for more control over the speed and direction of the ball, the bump is used only when the ball is so low it cannot be properly handled with fingertips, or in beach volleyball where rules regulating overhand setting are more stringent. In the case of a set, one also speaks of a front or back set, meaning whether the ball is passed in the direction the setter is facing or behind the setter. There is also a jump set that is used when the ball is too close to the net. In this case, the setter usually jumps off their right foot straight up to avoid going into the net. The setter usually stands about ⅔ of the way from the left to the right of the net and faces the left (the larger portion of net that he or she can see).</p></div><div class='set-img'></div></div></div><!-- Rules --><!-- terms --><!-- terms --><!-- terms --><!-- terms --><!-- terms --><!-- terms --><div class='terms'><h1>Basic Volleyball Terms</h1><div class='section-container'><div class='text'> <ul><li><b>Ace:</b> A serve that results directly in a point, usually when the ball hits the floor untouched on the receiving team’s side of the court.</li><li><b>Dig:</b> Passing a spiked or rapidly hit ball and low to ground. Defensive play. Slang for retrieving an attacked ball close to the floor. Statistically scored on a 3.0 point system.</li><li><b>Libero:</b> A player specialized in defensive skills. This player must wear a contrasting jersey color from his or her teammates and cannot block or attack the ball when it is entirely above net height. When the ball is not in play, the libero can replace any back-row player without prior notice to the officials.</li><li><b>Pancake:</b> One-hand floor defensive technique where the hand is extended and slid along the floor palm down while the player dives or extension rolls so the ball bounces off the back of the hand and is considered legal.</li><li><b>Shank:</b> Severely misdirected pass.</li><li><b>Spike:</b> Also called a hit or attack. A ball contacted with force by a player on the offensive team who intends to terminate the ball on the opponent’s floor or off the opponent’s blocker.</li><li><b>Switch:</b> To change court positions after a ball is served to facilitate strongest player positions.</li><li><b>Tip:</b> A one-handed, soft hit into the opponent’s court using the fingertips. Also called a dink.</li></ul></div><div class='terms-img'></div></div></div>" },
    { "pageName": "more", "content": "<!-- equipment --><!-- equipment --><!-- equipment --><!-- equipment --><!-- equipment --><!-- equipment --><!-- equipment --><div class='equipment'><h1>Basic Volleyball Equipment</h1><div class='section-container'><div class='text'> <ul><li><b>Solid Ball:</b> A good quality ball is the most important piece of equipment you can get while playing. a nice synthetic leather ball is ideal for outdoor play while a cloth or a standard leather ball is preferred for indoor play.</li><li><b>Kneepads:</b> Kneepads are suggested to help prevent bruising and burns from sliding on the court. These can be very important and the thickness of your knee pads will usually vary based on age and skill range.</li><li><b>Ankle Braces:</b> The most common injury is ankle related in volleyball and for that reason ankle braces are very important to consider when playing regularly.</li><li><b>Proper Footwear:</b> Men's and Women's volleyball shoes are essential for playing and is common to have a brown gum sole on the bottoms for maximum traction. They are designed for the side to side movements and frequent jumping common in volleyball.</li><li><b>A Net:</b> It is impossible to play a proper game of volleyball without a net. Setting the net to the right height can make all the difference in how the game is played out as well.</li></ul></div><div class='equipment-img'></div></div></div><!-- brands --><!-- brands --><!-- brands --><!-- brands --><!-- brands --><!-- brands --><!-- brands --><div class='brands'><h1>Major Volleyball Brands</h1><div class='section-container'><div class='text'><ul><li><b>Balls:</b><ul class='sublist'><li>Tachikara</li><li>Molten</li><li>Wilson</li><li>Mikasa</li><li>Mizuno</li><li>Nike</li><li>Spalding</li></ul></li><li><b>Kneepads:</b><ul class='sublist'><li>Tachikara</li><li>Asics</li><li>Under Armour</li><li>Mueller</li></ul></li><li><b>Footwear:</b> <ul class='sublist'><li>Mizuno</li><li>Asics</li><li>Nike</li></ul></li></ul></div><div class='brands-img'></div></div></div><!-- olympics --><!-- olympics --><!-- olympics --><!-- olympics --><!-- olympics --><!-- olympics --><!-- olympics --><div class='olympics'><h1>Olympics</h1><div class='section-container'><div class='text'><p>The history of Olympic volleyball can be traced back to the 1924 Summer Olympics in Paris, where volleyball was played as part of an American sports demonstration event. Its addition to the Olympic program, however, was given only after World War II, with the foundation of the FIVB and of some of the continental confederations. In 1957, a special tournament was held during the 53rd IOC session in Sofia, Bulgaria, to support such request. The competition was a success, and the sport was officially introduced in 1964. The Olympic Committee initially dropped volleyball for the 1968 Olympics, meeting protests.</p><p>The volleyball Olympic tournament was originally a simple competition, whose format paralleled the one still employed in the World Cup: all teams played against each other team and then were ranked by number of wins, set average and point average. One disadvantage of this round-robin system is that medal winners could be determined before the end of the games, making the audience lose interest in the outcome of the remaining matches.</p><p>To cope with this situation, the competition was split into two phases: a final round was introduced, consisting of quarterfinals, semifinals and finals. Since its creation in 1972, this new system has become the standard for the volleyball Olympic tournament, and is usually referred to as the Olympic format.</p><p>The number of teams involved in the games has grown steadily since 1964. Since 1996, both men's and women's indoor events count 12 participant nations. Each of the five continental volleyball confederations has at least one affiliated national federation involved in the Olympic Games.</p></div><div class='olympics-img'></div></div></div><!-- contact --><!-- contact --><!-- contact --><!-- contact --><!-- contact --><!-- contact --><!-- contact --><div class='contact'><h1>Contact</h1><form action='/action_page.php'><label for='fname'>First Name</label><input type='text' id='fname' name='firstname' placeholder='Your name..'><label for='lname'>Last Name</label><input type='text' id='lname' name='lastname' placeholder='Your last name..'><label for='subject'>Subject</label><textarea id='subject' name='subject' placeholder='Write something..' style='height:200px'></textarea><input type='submit' value='Submit'></form></div>" }
  ]
}
